{
    "HTMLTutorial": {
      "Introduction": {
        "What is HTML?": "HTML is the standard markup language for creating Web pages. HTML stands for Hyper Text Markup Language. HTML describes the structure of Web pages using markup. HTML elements are the building blocks of HTML pages. HTML elements are represented by tags. HTML tags label pieces of content such as 'heading', 'paragraph', 'table', and so on. Browsers do not display the HTML tags, but use them to render the content of the page."
      },
      "HTML Versions": {
        "Versions": [
          {"Version": "HTML", "Year": 1991},
          {"Version": "HTML 2.0", "Year": 1995},
          {"Version": "HTML 3.2", "Year": 1997},
          {"Version": "HTML 4.01", "Year": 1999},
          {"Version": "XHTML", "Year": 2000},
          {"Version": "HTML 5", "Year": 2014}
        ]
      },
      "HTML Tags": {
        "Introduction": "HTML tags are element names surrounded by angle brackets. HTML tags normally come in pairs like <p> and </p>. The first tag in a pair is the start tag, the second tag is the end tag. The end tag is written like the start tag, but with a forward slash inserted before the tag name. The start tag is also called the opening tag, and the end tag the closing tag.",
        "ImageSource": "This image is from MDN"
      },
      "Web Browsers": {
        "Introduction": "The purpose of a web browser (Chrome, IE, Firefox, Safari) is to read HTML documents and display them. The browser does not display the HTML tags, but uses them to determine how to display the document."
      },
      "HTML Page Structure": {
        "Introduction": "All HTML documents must start with a document type declaration: <!DOCTYPE html>. The <!DOCTYPE> declaration is not an HTML tag; it is an instruction to the web browser about what version of HTML the page is written in. The <!DOCTYPE> declaration is NOT case sensitive. The HTML document itself begins with <html> and ends with </html>. The visible part of the HTML document is between <body> and </body>.",
        "Example": {
          "HTMLPageStructure": [
            "<!DOCTYPE html>",
            "<html>",
            "<head>",
            "<title>Page Title</title>",
            "</head>",
            "<body>",
            "<h1>My First Heading</h1>",
            "<p>My first paragraph.</p>",
            "</body>",
            "</html>"
          ],
          "Explanation": "Only the content inside the <body> section (the white area above) is displayed in a browser."
        },
        "Details": {
          "Doctype": "The <!DOCTYPE html> declaration defines this document to be HTML5",
          "HtmlElement": "The <html> element is the root element of an HTML page",
          "HeadElement": "The <head> element contains meta information about the document",
          "TitleElement": "The <title> element specifies a title for the document",
          "BodyElement": "The <body> element contains the visible page content",
          "H1Element": "The <h1> element defines a large heading",
          "PElement": "The <p> element defines a paragraph"
        }
      },
      "Styling HTML with CSS": {
        "Introduction": "CSS is a language that describes the style of an HTML document. CSS describes how HTML elements should be displayed. CSS saves a lot of work. It can control the layout of multiple web pages all at once.",
        "Methods": {
          "Inline": "<h1 style='color:blue;'>This is a Blue Heading</h1>",
          "Internal": [
            "<!DOCTYPE html>",
            "<html>",
            "<head>",
            "<style>",
            "body {background-color: powderblue;}",
            "h1   {color: blue;}",
            "p    {color: red;}",
            "</style>",
            "</head>",
            "<body>",
            "<h1>This is a heading</h1>",
            "<p>This is a paragraph.</p>",
            "</body>",
            "</html>"
          ],
          "External": [
            "<!DOCTYPE html>",
            "<html>",
            "<head>",
            "<link rel='stylesheet' href='styles.css'>",
            "</head>",
            "<body>",
            "<h1>This is a heading</h1>",
            "<p>This is a paragraph.</p>",
            "</body>",
            "</html>"
          ]
        },
        "CommonMethod": "The most common way to add CSS, is to keep the styles in separate CSS files."
      },
      "JavaScript and HTML": {
        "Introduction": "Makes HTML pages more dynamic and interactive by JavaScript. The <script> tag is used to define a client-side script (JavaScript). The <script> element either contains scripting statements, or it points to an external script file through the src attribute. Common uses for JavaScript are image manipulation, form validation, and dynamic changes of content.",
        "Example": "<script>document.getElementById('demo').innerHTML = 'Hello JavaScript!';</script>"
      },
      "HTML Elements": {
        "Introduction": "An HTML element usually consists of a start tag and end tag, with the content inserted in between. The HTML element is everything from the start tag to the end tag. HTML elements with no content are called empty elements. Empty elements do not have an end tag, such as the <br> element (which indicates a line break).",
        "NestedElements": "HTML elements can be nested (elements can contain elements). All HTML documents consist of nested HTML elements.",
        "EndTagReminder": "Some HTML elements will display correctly, even if you forget the end tag. Never rely on this. It might produce unexpected results and/or errors if you forget the end tag.",
        "EmptyElements": "HTML elements with no content are called empty elements. <br> is an empty element without a closing tag (the <br> tag defines a line break). Empty elements can be 'closed' in the opening tag like this: <br />. HTML5 does not require empty elements to be closed. But if you want stricter validation, or if you need to make your document readable by XML parsers, you must close all HTML elements properly.",
        "LowerCaseTags": "HTML tags are not case sensitive: <P> means the same as <p>. The HTML5 standard does not require lowercase tags, but W3C recommends lowercase in HTML, and demands lowercase for stricter document types like XHTML."
      },
      "HTML Attributes": {
        "Introduction": "All HTML elements can have attributes. Attributes provide additional information about an element. Attributes are always specified in the start tag. Attributes usually come in name/value pairs like: name='value'.",
        "LowerCaseAttributes": "The HTML5 standard does not require lowercase attribute names. The title attribute can be written with uppercase or lowercase like Title and/or TITLE. W3C recommends lowercase in HTML, and demands lowercase for stricter document types like XHTML.",
        "QuoteAttributeValues": "The HTML5 standard does not require quotes around attribute values. W3C recommends quotes in HTML, and demands quotes for stricter document types like XHTML. Sometimes it is necessary to use quotes. This example will not display the title attribute correctly, because it contains a space: <p title=About W3Schools>. Using quotes are the most common. Omitting quotes can produce errors.",
        "SingleOrDoubleQuotes": "Double quotes around attribute values are the most common in HTML, but single quotes can also be used. In some situations, when the attribute value itself contains double quotes, it is necessary to use single quotes: <p title='John \"ShotGun\" Nelson'>. Or vice versa: <p title=\"John 'ShotGun' Nelson\">.",
        "GlobalAttributes": "The global attributes can be used on any HTML element, such as id, class, and style.",
        "DataAttributes": {
          "Introduction": "The data-* attributes is a global attribute used to store custom data private to the page or application. The data-* attributes gives us the ability to embed custom data attributes on all HTML elements. The stored (custom) data can then be used in the page's JavaScript to create a more engaging user experience (without any Ajax calls or server-side database queries).",
          "Details": "The data-* attributes consist of two parts: The attribute name should not contain any uppercase letters, and must be at least one character long after the prefix 'data-'. The attribute value can be any string. The * may be replaced by any name following the production rule of XML names with the following restrictions: the name must not start with XML, whatever case is used for these letters; the name must not contain any semicolon (U+003A); the name must not contain capital A to Z letters."
        }
      },
      "Comments": {
        "HTMLComment": "Comment tags are used to insert comments in the HTML source code. You can add comments to your HTML source by using the following syntax: <!-- Write your comments here -->. There is an exclamation point (!) in the opening tag, but not in the closing tag. Comments are not displayed by the browser, but they can help document your HTML source code.",
        "ConditionalComments": "You might stumble upon conditional comments in HTML: <!--[if IE 9]> <p>You are using Internet Explorer 9.</p> <![endif]--> These comments are only recognized by Internet Explorer (IE). Conditional comments are gone in IE10 and later."
      }
    }
  }
  